myos.html
---
title: "My Operating System"
date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-16 Mon&gt;</span></span>
layout: post
categories: 
tags: 
- myos
published: true
comments: 
---
<div id="outline-container-org2476485" class="outline-2">
<h2 id="org2476485">Definitions</h2>
<div class="outline-text-2" id="text-org2476485">
</div>
<div id="outline-container-definition-work" class="outline-3">
<h3 id="definition-work">work</h3>
<div class="outline-text-3" id="text-definition-work">
<div class="org-src-container">
<pre class="src src-keypoint">   myOS / definition work
   Work is expending energy.
</pre>
</div>
</div>
</div>
<div id="outline-container-definition-task" class="outline-3">
<h3 id="definition-task">task</h3>
<div class="outline-text-3" id="text-definition-task">
<div class="org-src-container">
<pre class="src src-keypoint">   myOS / definition task
   A task is a request for work to create a result for a purpose.
</pre>
</div>
</div>
</div>
<div id="outline-container-definition-machine" class="outline-3">
<h3 id="definition-machine">machine</h3>
<div class="outline-text-3" id="text-definition-machine">
<div class="org-src-container">
<pre class="src src-keypoint">   myOS / definition machine
   A machine is a tool capable of doing work to produce a result.
</pre>
</div>
</div>
</div>
<div id="outline-container-definition-system" class="outline-3">
<h3 id="definition-system">system</h3>
<div class="outline-text-3" id="text-definition-system">
<div class="org-src-container">
<pre class="src src-keypoint">   myOS / definition system
   A system is a collection of tools configured to complete a category of tasks.
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga25839b" class="outline-2">
<h2 id="orga25839b">Theorems</h2>
<div class="outline-text-2" id="text-orga25839b">
</div>
<div id="outline-container-theorem-1" class="outline-3">
<h3 id="theorem-1">one</h3>
<div class="outline-text-3" id="text-theorem-1">
<div class="org-src-container">
<pre class="src src-keypoint">   myOS / theorem 1
   An email account provides an interface for the outside world for you to send and receive tasks and work.
</pre>
</div>
</div>
</div>
<div id="outline-container-theorem-2" class="outline-3">
<h3 id="theorem-2">two</h3>
<div class="outline-text-3" id="text-theorem-2">
<div class="org-src-container">
<pre class="src src-keypoint">   myOS / theorem 2
   To maximise efficiency towards reaching your goals:
     - only work for a task
     - only accept tasks with purpose that you accept as a human
</pre>
</div>
</div>
</div>
<div id="outline-container-theorem-3" class="outline-3">
<h3 id="theorem-3">three</h3>
<div class="outline-text-3" id="text-theorem-3">
<div class="org-src-container">
<pre class="src src-keypoint">   myOS / theorem 3
   Your energy resource can be extended to superhuman by delegating to other humans or machines.
</pre>
</div>
</div>
</div>
</div>
